heatTransfer/chtMultiRegionFoam/heatExchanger/constant/porous/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState icoPolynomial;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    // coefficients for water

    specie
    {
        molWeight       18;
    }
    equationOfState
    {
        rhoCoeffs<8>    ( 1000 0 0 0 0 0 0 0 );
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        CpCoeffs<8>     ( 4183 0 0 0 0 0 0 0 );
    }
    transport
    {
        muCoeffs<8>     ( 0.001 0 0 0 0 0 0 0 );
        kappaCoeffs<8>  ( 0.58  0 0 0 0 0 0 0 );
    }
}

// ************************************************************************* //
